import "./VipPage.scss"
import { useUserData } from "../../context/userContext"
import { baseimage } from "../../fetch/index"
import { Link } from "react-router-dom"
import { upgradevip } from "../../fetch/user"

function VipPage() {
  const [user] = useUserData()

  function handlechangetypehearder(e) {
    document.querySelector(".active")?.classList.remove("active")
    e.target.parentElement.classList.add("active")
  }

  function handleupgradevip() {
    upgradevip()
  }

  return (
    <div className="upgradevip">
      <div className="hearder">
        <div className="wraphearder">
          <Link to={"/"} className="wraplogo">
            <img src="https://zmp3-static.zmdcdn.me/skins/zmp3-v6.1/images/backgrounds/logo-dark.svg" />
          </Link>
          <div className="wrapoptionhearder">
            <div className="upgrade active">
              <div className="text" onClick={handlechangetypehearder}>NÂNG CẤP</div>
            </div>
            <div className="code">
              <div className="text" onClick={handlechangetypehearder}>NHẬP CODE</div>
            </div>
            <div className="support">
              <div className="text" onClick={handlechangetypehearder}>HỖ TRỢ</div>
            </div>
            <div className="distance">
              <span></span>
            </div>
            <div className="user">
              {
                user?.avatar ?
                  <div className="wrapuser">
                    <img src={`${baseimage}/avatar/${user.avatar}`}></img>
                  </div> :
                  <div className="btnlogin">
                    ĐĂNG NHẬP
                  </div>
              }
            </div>
          </div>
        </div>
      </div>
      <div className="content">
        <div className="title">
          <div className="wraptitle">
            <div className="titleitem1">
              <h1>Âm Nhạc Không Giới Hạn</h1>
            </div>
            <div className="titleitem2">
              <div>
                Nâng cấp tài khoản để trải nghiệm các tính năng và nội dung cao cấp
              </div>
            </div>

          </div>
        </div>
        <div className="main">
          <div className="wrapmain">
            <div className="mainitemplus">
              <div className="title">
                <div className="text">Zing MP3</div>
                <svg width="82" height="30" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="0.647" y="0.883" width="81.176" height="28.235" rx="7.059" fill="#fff">
                  </rect><g clipPath="url(#tag-plus-white_svg__clip0_3671_4052)" fill="#4E2A8C">
                    <path d="M22.043 8.641c-.821-.338-1.794-.507-2.897-.507h-5.448a.693.693 0 00-.497.19.662.662 0 00-.195.486v12.364c0 .19.065.359.195.486s.303.19.497.19h2.638a.693.693 0 00.497-.19.637.637 0 00.238-.508V17.2h2.097c1.103 0 2.075-.148 2.875-.465.844-.317 1.514-.824 1.968-1.479.475-.676.713-1.522.713-2.536s-.238-1.902-.713-2.579c-.454-.676-1.124-1.183-1.968-1.521v.021zm-1.362 4.058c0 .507-.13.866-.432 1.12-.281.253-.67.36-1.19.36h-2.053v-2.98h2.054c.584 0 .994.147 1.232.422.26.296.368.655.368 1.078h.021zM37.957 18.574h-5.665V8.81c0-.19-.086-.38-.216-.486a.679.679 0 00-.476-.19h-2.572a.693.693 0 00-.497.19.662.662 0 00-.195.486v12.364c0 .19.065.359.195.486s.302.19.497.19h8.929a.693.693 0 00.497-.19.637.637 0 00.238-.508V19.25c0-.19-.087-.38-.216-.486-.13-.148-.303-.211-.52-.211v.021zM53.093 7.941h-2.53a.76.76 0 00-.497.196.692.692 0 00-.195.5v7.853c0 .783-.194 1.37-.562 1.74-.367.37-.864.544-1.535.544-.67 0-1.21-.174-1.578-.544-.367-.391-.54-.978-.54-1.74V8.638a.692.692 0 00-.195-.5.683.683 0 00-.497-.197h-2.508a.683.683 0 00-.497.196.691.691 0 00-.195.5v7.875c0 1.262.26 2.306.757 3.133.497.826 1.21 1.435 2.119 1.849.908.391 1.967.565 3.156.565 1.19 0 2.27-.196 3.157-.566a4.52 4.52 0 002.118-1.848c.498-.827.757-1.893.757-3.133V8.637a.71.71 0 00-.216-.5.668.668 0 00-.476-.196h-.043zM68.937 15.656c-.367-.55-.93-.993-1.686-1.331-.735-.339-1.708-.613-2.897-.825a19.901 19.901 0 01-1.665-.422c-.367-.127-.627-.275-.778-.444a.762.762 0 01-.195-.529c0-.338.108-.57.368-.718.281-.17.692-.275 1.232-.275.497 0 .887.106 1.168.296.28.17.454.38.519.592v.063c.13.148.237.254.389.317.13.064.28.085.454.085h2.572a.63.63 0 00.454-.19.663.663 0 00.174-.423c0-.444-.152-.888-.411-1.332-.238-.443-.627-.887-1.103-1.289-.497-.401-1.102-.718-1.794-.95-.692-.233-1.514-.36-2.422-.36-1.124 0-2.119.169-2.94.528-.843.36-1.492.867-1.989 1.5a3.702 3.702 0 00-.692 2.199c0 .824.195 1.521.584 2.092.389.55.951.993 1.665 1.353.713.317 1.578.591 2.572.803.757.148 1.362.296 1.816.444.433.126.735.274.93.443a.68.68 0 01.238.529c0 .317-.151.57-.476.76-.346.212-.865.318-1.578.318-.432 0-.8-.043-1.06-.127a2.201 2.201 0 01-.67-.38 4.971 4.971 0 01-.41-.529.86.86 0 00-.325-.296c-.13-.084-.302-.127-.54-.127h-2.443a.63.63 0 00-.454.19.583.583 0 00-.173.423c.021.698.28 1.374.735 1.987.454.613 1.146 1.12 2.032 1.5.887.36 1.99.55 3.308.55 1.167 0 2.205-.17 3.113-.507.908-.339 1.643-.846 2.162-1.5.54-.677.8-1.48.8-2.368 0-.803-.173-1.5-.54-2.029l-.044-.021z">
                    </path></g><defs><clipPath id="tag-plus-white_svg__clip0_3671_4052"><path fill="#fff" transform="translate(13 7.941)" d="M0 0h56.471v14.118H0z">
                    </path></clipPath></defs>
                </svg>
              </div>
              <div className="price">
                <div onClick={handleupgradevip} className="pricetext">Chỉ Từ 300,000 VND</div>
              </div>
              <div className="btnsubmit">
                <div className="btn">ĐĂNG KÝ GÓI</div>
              </div>
              <div className="titlepermissions">
                <div className="text">Đặt Quyền:</div>
              </div>
              <div className="listpermissions">
                <div className="permissionsitem">
                  <div>Nghe Nhạc Không Quảng Cáo</div>
                </div>
                <div className="permissionsitem">
                  <div>Tải Nhạc Không Giới Hạn</div>
                </div>
                <div className="permissionsitem">
                  <div>Upload Không Giới Hạn</div>
                </div>
              </div>

            </div>
            <div className="mainitempremium">
              <div className="title">
                <div className="text">Zing MP3</div>
                <svg width="128" height="30" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <rect x="0.647" y="0.883" width="127.059" height="28.235" rx="7.059" fill="#fff">
                  </rect><g clipPath="url(#tag-premium-white_svg__clip0_3671_5278)" fill="#654C0C">
                    <path d="M22.057 8.472c-.81-.346-1.783-.53-2.895-.53H13.72c-.208 0-.37.069-.51.207a.677.677 0 00-.208.508V21.32c0 .207.07.392.209.507a.682.682 0 00.51.208h2.616c.208 0 .394-.07.51-.185a.667.667 0 00.231-.53v-4.037h2.084c1.112 0 2.061-.162 2.895-.485a4.216 4.216 0 001.968-1.522c.486-.692.718-1.569.718-2.607 0-1.038-.232-1.937-.718-2.652-.463-.693-1.135-1.223-1.968-1.57v.024zm-1.39 4.175c0 .508-.139.877-.417 1.13-.277.254-.671.37-1.157.37h-2.038v-3.022h2.038c.579 0 .995.138 1.227.415.255.3.37.646.37 1.107h-.023zM37.617 16.5c.649-.346 1.204-.808 1.621-1.408.486-.668.718-1.499.718-2.468 0-1.476-.533-2.653-1.552-3.46-.995-.807-2.385-1.223-4.098-1.223h-5.303c-.209 0-.37.07-.51.208a.677.677 0 00-.208.508V21.32c0 .207.07.392.208.507a.682.682 0 00.51.208h2.5c.21 0 .394-.07.51-.208a.677.677 0 00.209-.507v-4.106h1.62l2.154 4.152c.07.115.162.254.301.415.162.162.394.254.718.254h2.57a.69.69 0 00.463-.185.651.651 0 00.209-.46.63.63 0 00-.093-.324l-2.57-4.59.023.023zm-1.737-3.922c0 .461-.139.808-.393 1.061-.255.254-.649.392-1.205.392h-2.014v-2.906h2.014c.556 0 .973.138 1.205.392.254.277.393.623.393 1.061zM53.896 18.783H47.76v-2.26h5.558c.208 0 .393-.07.532-.208.139-.138.185-.323.185-.507V14.1c0-.208-.07-.37-.185-.508a.672.672 0 00-.532-.23H47.76v-2.169h5.974c.209 0 .37-.07.51-.208a.677.677 0 00.208-.507V8.657c0-.208-.07-.37-.208-.508a.682.682 0 00-.51-.208h-9.077c-.209 0-.37.07-.51.208a.677.677 0 00-.208.508V21.32c0 .207.07.392.208.507a.682.682 0 00.51.208h9.24c.208 0 .37-.07.509-.208a.677.677 0 00.208-.507v-1.823c0-.207-.07-.369-.208-.507a.682.682 0 00-.51-.208zM71.636 7.941h-2.084a.928.928 0 00-.671.254c-.093.115-.186.208-.232.3l-3.219 5.79-3.195-5.767s-.14-.208-.255-.323c-.14-.161-.37-.254-.648-.254h-2.108a.761.761 0 00-.51.208.677.677 0 00-.208.508V21.32c0 .207.07.392.209.53.139.139.324.185.51.185h2.338c.209 0 .394-.07.51-.208a.677.677 0 00.208-.507v-6.39l1.76 3.276c.07.138.185.276.3.369.14.138.348.184.58.184h1.019c.231 0 .44-.069.579-.184a.969.969 0 00.277-.37l1.76-3.275v6.39c0 .207.07.392.209.53.139.139.324.185.532.185h2.316c.209 0 .394-.07.51-.185a.667.667 0 00.231-.53V8.657c0-.208-.07-.393-.231-.508a.682.682 0 00-.51-.208h.023zM80.109 7.941h-2.617c-.209 0-.394.07-.51.208a.677.677 0 00-.208.508V21.32c0 .207.07.392.208.507a.682.682 0 00.51.208h2.617c.208 0 .393-.07.509-.208a.677.677 0 00.208-.507V8.657c0-.208-.07-.37-.208-.508a.682.682 0 00-.51-.208zM96.503 7.941H93.98a.761.761 0 00-.51.208.677.677 0 00-.208.508v7.82c0 .76-.185 1.337-.556 1.73-.37.369-.856.553-1.528.553s-1.204-.184-1.552-.553c-.37-.37-.532-.97-.532-1.73v-7.82c0-.208-.07-.37-.209-.508a.682.682 0 00-.509-.208h-2.5c-.21 0-.395.07-.51.208a.677.677 0 00-.209.508V16.5c0 1.245.255 2.306.741 3.137a4.881 4.881 0 002.13 1.845c.904.393 1.969.577 3.173.577s2.27-.184 3.173-.577a4.605 4.605 0 002.13-1.845c.51-.83.741-1.892.741-3.137V8.657c0-.208-.07-.393-.231-.508a.668.668 0 00-.487-.208h-.023zM115.123 8.149a.682.682 0 00-.509-.208h-2.084c-.301 0-.51.093-.649.254a1.146 1.146 0 00-.231.3l-3.219 5.79-3.219-5.767s-.139-.208-.255-.323c-.139-.161-.37-.254-.648-.254h-2.107a.72.72 0 00-.51.208.676.676 0 00-.208.508V21.32c0 .207.069.392.208.53.139.139.324.185.51.185h2.339c.208 0 .393-.07.509-.208a.676.676 0 00.208-.507v-6.39l1.76 3.276c.07.138.186.276.301.369.139.138.348.184.579.184h1.019c.232 0 .44-.069.579-.184a.965.965 0 00.278-.37l1.76-3.275v6.39c0 .207.069.392.208.53.139.139.325.185.533.185h2.316c.208 0 .393-.07.509-.185a.667.667 0 00.232-.53V8.657c0-.208-.07-.393-.232-.508h.023z">
                    </path></g><defs><clipPath id="tag-premium-white_svg__clip0_3671_5278">
                      <path fill="#fff" transform="translate(13 7.941)" d="M0 0h102.353v14.118H0z">
                      </path></clipPath></defs>
                </svg>
              </div>
              <div className="price">
                <div className="pricetext">Chỉ Từ 500,000 VND</div>
              </div>
              <div className="btnsubmit">
                <div onClick={handleupgradevip} className="btnpremium">ĐĂNG KÝ GÓI</div>
              </div>
              <div className="titlepermissions">
                <div className="text">Đặt Quyền:</div>
              </div>
              <div className="listpermissions">
                <div className="permissionsitem">
                  <div>Nghe Nhạc Không Quảng Cáo</div>
                </div>
                <div className="permissionsitem">
                  <div>Tải Nhạc Không Giới Hạn</div>
                </div>
                <div className="permissionsitem">
                  <div>Upload Không Giới Hạn</div>
                </div>
              </div>

            </div>
          </div>
        </div>
      </div>
    </div>
  )
}


export default VipPage